A TIME SERIES DATA IS THE SERIES OF DATA POINTS LISTED IN TIME ORDER
A TIME SERIES IS A SEQUENCE OF SUCCESSIVE EQUAL UNTERVAL POINTS OF TIME
A TIME SERIES ANALYSIS CONSISTS OF METHODS FOR ANALYZING DATA

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('/workspaces/DAV/stock_data.csv')
print(df)

            Date   Open   High    Low  Close    Volume  Name
0       1/3/2006  39.69  41.22  38.79  40.91  24232729  AABA
1       1/4/2006  41.22  41.90  40.77  40.97  20553479  AABA
2       1/5/2006  40.93  41.73  40.85  41.53  12829610  AABA
3       1/6/2006  42.88  43.57  42.80  43.21  29422828  AABA
4       1/9/2006  43.10  43.66  42.82  43.42  16268338  AABA
...          ...    ...    ...    ...    ...       ...   ...
2258  12/23/2014  51.46  51.46  49.93  50.02  15514036  AABA
2259  12/24/2014  50.19  50.92  50.19  50.65   5962870  AABA
2260  12/26/2014  50.65  51.06  50.61  50.86   5170048  AABA
2261  12/29/2014  50.67  51.01  50.51  50.53   6624489  AABA
2262  12/30/2014  50.35  51.27  50.35  51.22  10703455  AABA

[2263 rows x 7 columns]

In [4]:
df.head()

       Date   Open   High    Low  Close    Volume  Name
0  1/3/2006  39.69  41.22  38.79  40.91  24232729  AABA
1  1/4/2006  41.22  41.90  40.77  40.97  20553479  AABA
2  1/5/2006  40.93  41.73  40.85  41.53  12829610  AABA
3  1/6/2006  42.88  43.57  42.80  43.21  29422828  AABA
4  1/9/2006  43.10  43.66  42.82  43.42  16268338  AABA

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2263 entries, 0 to 2262
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    2263 non-null   object
 1   Open    2263 non-null   float64
 2   High    2263 non-null   float64
 3   Low     2263 non-null   float64
 4   Close   2263 non-null   float64
 5   Volume  2263 non-null   int64
 6   Name    2263 non-null   object
dtypes: float64(4), int64(1), object(2)
memory usage: 123.9+ KB

In [6]:

df.isnull()

       Date   Open   High    Low  Close  Volume   Name
0     False  False  False  False  False   False  False
1     False  False  False  False  False   False  False
2     False  False  False  False  False   False  False
3     False  False  False  False  False   False  False
4     False  False  False  False  False   False  False
...     ...    ...    ...    ...    ...     ...    ...
2258  False  False  False  False  False   False  False
2259  False  False  False  False  False   False  False
2260  False  False  False  False  False   False  False
2261  False  False  False  False  False   False  False
2262  False  False  False  False  False   False  False

[2263 rows x 7 columns]

In [9]:
df.isna().count()

Date      2263
Open      2263
High      2263
Low       2263
Close     2263
Volume    2263
Name      2263
dtype: int64